joe-hung/ME446_repo/C2000Ware_4_01_00_00/device_support/f2833x/examples/f28335_me446starter/F28335_spi.c

#include "F28335_spi.h"
#include "DSP28x_Project.h"     // Device Headerfile and Examples Include File

void init_SPI(void);

long SPIbyte1,SPIbyte2,SPIbyte3,SPIbyte4,SPIbyte5;
long SPIenc1_reading = 0;
long SPIenc2_reading = 0;
long SPIenc3_reading = 0;
long SPIenc4_reading = 0;
long SPIenc5_reading = 0;
int SPIenc_state = 0;
int	SPIenc_state_errors = 0;
float pwm1 = 0;
float pwm2 = 0;
float pwm3 = 0;
float pwm4 = 0;
float pwm5 = 0;
float dec1 = 0;
float dec2 = 0;
float dec3 = 0;
float dec4 = 0;
float dec5 = 0;

short dummy = 0;


unsigned int dac1data = 0;
unsigned int dac2data = 0;

int SPI_finished = 1;
int pwm_finished = 1;

// SpiaRegs.SPIFFRX.bit.RXFFIL is the max # of bytes allowed to sit in FIFO.
// Since we have to write an command to LS7366 at first and all four LS7366 are
//  set to 4-byte counting mode, when reading from them SpiaRegs.SPIFFRX.bit.RXFFIL
//  should be set to 5.

void init_SPI(void){
    /*****************************************************/
    /*********  SPI  *************************************/
    EALLOW;
    // Set EALLOW bit
    // Disable CPU write access, allowing CPU to write freely to protected registers

    GpioCtrlRegs.GPAMUX1.bit.GPIO9 = 0;
    GpioCtrlRegs.GPAMUX1.bit.GPIO10 = 0;
    GpioCtrlRegs.GPAMUX1.bit.GPIO11 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO22 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO23 = 0;
    // Configure the GPIO9, 10, 11, 22 pins as: General purpose I/O
    GpioCtrlRegs.GPADIR.bit.GPIO6 = 1;
    // Used for debug

    GpioCtrlRegs.GPADIR.bit.GPIO9 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO10 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO11 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO22 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO23 = 1;
    // Configures the GPIO09, 10, 11, 22 pins as output

    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;
    // Don't care

    GpioDataRegs.GPASET.bit.GPIO9 = 1;
    GpioDataRegs.GPASET.bit.GPIO10 = 1;
    GpioDataRegs.GPASET.bit.GPIO11 = 1;
    GpioDataRegs.GPASET.bit.GPIO22 = 1;
    GpioDataRegs.GPASET.bit.GPIO23 = 1;
    // Drive GPIO9, 10, 11, 22 high, hold LS7366's in high impedance mode


    //6/6/2016 Adding GPIO85 as CS for slave MC
    GpioCtrlRegs.GPCMUX2.bit.GPIO85 = 0;  // use GPIO85 for CS
    GpioCtrlRegs.GPCDIR.bit.GPIO85 = 1;
    GpioDataRegs.GPCSET.bit.GPIO85 = 1;

    EDIS;
    // Disable CPU write access

    // This part set GPIO 10, 11, 22 as GPIO output and drive them high to hold LS7366's in high impedance mode
    // Transition from low to high disables serial data transmission

    // ---------------------------------------------------------------------------------------------------------------------------------------------------------
    // ---------------------------------------------------------------------------------------------------------------------------------------------------------

    InitSpiaGpio();
    // Some function in headfiles?

    //	EALLOW;
    // SS for DAC7564
    //		GpioCtrlRegs.GPAMUX2.bit.GPIO19 = 0;  // use GPIO19 for SS
    //		GpioDataRegs.GPASET.bit.GPIO19 = 1;  // enabled
    //		GpioCtrlRegs.GPADIR.bit.GPIO19 = 1;  // GPIO19 as output
    //	EDIS;
    // Don't care


    SpiaRegs.SPICCR.bit.SPISWRESET = 0;  // Put SPI in reset, clear SPISTS(SPI status registe).5-7
    // SPISTS.5 is TX BUF FULL Flag;
    // SPISTS.6 is SPI INT Flag;
    // SPISTS.7 is RECEIVER OVERRUN Flag;

    SpiaRegs.SPICCR.bit.CLKPOLARITY = 0;
    SpiaRegs.SPICTL.bit.CLK_PHASE = 1; // Set SCLK for LS7366

    SpiaRegs.SPICCR.bit.SPICHAR = 7;   // set to transmitt 8 bits (Table 2-2 of SPI Guide)

    SpiaRegs.SPICTL.bit.MASTER_SLAVE = 1; // SPI configured as a master
    SpiaRegs.SPICTL.bit.TALK = 1; // Enables transmission for the 4-pin option, ensure to enable the receiver's ~SPISET input pin

    SpiaRegs.SPICTL.bit.SPIINTENA = 0; // Disables the SPI’s ability to generate a transmit/receive interrupt before necessary configurations are made

    SpiaRegs.SPISTS.all=0x00E0; // set SPISTS.5-7
    //? Why reset then set
    // No reason, Dan forgot to change

    // This part is for setting transition: CLK, Data size, Master, Mode
    // ---------------------------------------------------------------------------------------------------------------------------------------------------------
    // ---------------------------------------------------------------------------------------------------------------------------------------------------------

    SpiaRegs.SPIBRR = 31;   // divide by 40 3.75 Mhz, 1.4.3 of SPI Guide

    SpiaRegs.SPIFFTX.bit.SPIRST = 1; // SPI FIFO resumes transmit or receive, 2.1.9 of SPI Guide
    SpiaRegs.SPIFFTX.bit.SPIFFENA = 1; // SPI FIFO enhancements enabled (don't know what this means)
    SpiaRegs.SPIFFTX.bit.TXFIFO = 0; // Write 0 to reset the FIFO pointer to zero, and hold in reset.
    SpiaRegs.SPIFFTX.bit.TXFFINTCLR = 1; // Clear TXFFINT flag in bit 7 (TXFFINT)

    SpiaRegs.SPIFFRX.bit.RXFIFORESET = 0; // Reset the FIFO pointer to zero, and hold in reset
    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR = 1; // Clear RXFFOVF flag (indicates if RX FIFO overflows)
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR = 1; // Clear RXFFINT flag (indicates if FXFIFO int. has occurred)
    SpiaRegs.SPIFFRX.bit.RXFFIL = 5; // RX FIFO generates an int. when RXFFST (FIFO status bits) are greater than or equal to 00101
    SpiaRegs.SPIFFRX.bit.RXFFIENA = 0; // RX FIFO int. based on RXFFIL match disabled

    SpiaRegs.SPIFFCT.all=0x00; // zero delay between every transfer from FIFO from FIFO transmit buffer to transmit shift register; 2.1.9 SPI Guide

    SpiaRegs.SPIPRI.bit.FREE = 1; // Free run, continue SPI operation regardless of suspend or when the suspend occurred
    SpiaRegs.SPIPRI.bit.SOFT = 0; // 2.1.10 SPI Guide
    // This part is for initializing TX&RX FIFO: resume FIFO, then Clear TX/RX FIFO and flag, set transfer delay and free run mode

    // ---------------------------------------------------------------------------------------------------------------------------------------------------------
    // ---------------------------------------------------------------------------------------------------------------------------------------------------------

