joe-hung/ME446_repo/C2000Ware_4_01_00_00/device_support/f2833x/examples/f28335_me446starter/F28335_spi.c
    SpiaRegs.SPICCR.bit.SPISWRESET = 1;  // Pull the SPI out of reset； SPI is ready to transmit or receive the next character

    SpiaRegs.SPIFFTX.bit.TXFIFO=1; // Enable TX FIFO operation; 2.1.9 SPI Guide
    SpiaRegs.SPIFFRX.bit.RXFIFORESET=1; // Re-enable RX FIFO operation;

    SpiaRegs.SPIFFRX.bit.RXFFIL = 1; // Receive FIFO int. level bits; same as above; 2.1.10 SPI Guide
    GpioDataRegs.GPACLEAR.bit.GPIO9 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO10 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO11 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO22 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO23 = 1;	// Drive these pins low, enable serial data transfer
    SpiaRegs.SPITXBUF = ((unsigned)0x20)<<8;  // CLR COUNT all five chips
    // Transfer 0010 0000 --> 00 100 000 to LS7366: CLR register CNTR
    while (SpiaRegs.SPIFFRX.bit.RXFFST != 1) {} // Wait until RX FIFO has one word
    DELAY_US(1000);
    GpioDataRegs.GPASET.bit.GPIO9 = 1;
    GpioDataRegs.GPASET.bit.GPIO10 = 1;
    GpioDataRegs.GPASET.bit.GPIO11 = 1;
    GpioDataRegs.GPASET.bit.GPIO22 = 1;
    GpioDataRegs.GPASET.bit.GPIO23 = 1;	// Pull pins high to disable serial data transfer
    SPIbyte1 = SpiaRegs.SPIRXBUF;  // Read from SPI RX BUFF (I guess it would be reading nonsense)

    SpiaRegs.SPIFFRX.bit.RXFFIL = 2; // Receive FIFO int. level bits set to 2;
    GpioDataRegs.GPACLEAR.bit.GPIO9 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO10 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO11 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO22 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO23 = 1; // Drive these pins low to start transition

    SpiaRegs.SPITXBUF = ((unsigned)0x88)<<8;  // WR to MDR0
    SpiaRegs.SPITXBUF = ((unsigned)0x83)<<8;
    // Transfer 1000 1000 --> 10 001 000: WR (0x83?) to MDR0 register
    //? MDR0: 1 0 00 00 11 --> four cnt per quad cycle, free-running cnt mode (always running), disable index (?), negative index input (?), filter clk div factor = 2 (?)
    while (SpiaRegs.SPIFFRX.bit.RXFFST != 2) {} // Wait until RX FIFO has two words, then manually read from BUFF (since cannot generate int.)
    DELAY_US(1000);
    GpioDataRegs.GPASET.bit.GPIO9 = 1;
    GpioDataRegs.GPASET.bit.GPIO10 = 1;
    GpioDataRegs.GPASET.bit.GPIO11 = 1;
    GpioDataRegs.GPASET.bit.GPIO22 = 1;
    GpioDataRegs.GPASET.bit.GPIO23 = 1;	// Pull pins high to disable serial data transfer
    SPIbyte1 = SpiaRegs.SPIRXBUF;
    SPIbyte2 = SpiaRegs.SPIRXBUF; // Read from SPI RX BUFF (I guess it would be reading nonsense)


    SpiaRegs.SPIFFRX.bit.RXFFIL = 2;
    GpioDataRegs.GPACLEAR.bit.GPIO9 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO10 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO11 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO22 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO23 = 1;	// Drive these pins low to start transition
    SpiaRegs.SPITXBUF = ((unsigned)0x90)<<8;  // WR MDR1
    SpiaRegs.SPITXBUF = 0x00<<8;
    // Transfer 1001 0000 --> 10 010 000: WR (0?) to MDR1
    // 0000 0 00: NOP*4, Not used, enable cnting, 4-byte counter mode (size of OTR?)
    while (SpiaRegs.SPIFFRX.bit.RXFFST != 2) {}
    DELAY_US(1000);
    GpioDataRegs.GPASET.bit.GPIO9 = 1;
    GpioDataRegs.GPASET.bit.GPIO10 = 1;
    GpioDataRegs.GPASET.bit.GPIO11 = 1;
    GpioDataRegs.GPASET.bit.GPIO22 = 1;
    GpioDataRegs.GPASET.bit.GPIO23 = 1;	// Pull pins high to disable serial data transfer
    SPIbyte1 = SpiaRegs.SPIRXBUF;
    SPIbyte2 = SpiaRegs.SPIRXBUF; // Read from SPI RX BUFF (I guess it would be reading nonsense)


    SpiaRegs.SPIFFRX.bit.RXFFIL = 1; // Receive FIFO int. level bits; same as above; 2.1.10 SPI Guide
    GpioDataRegs.GPACLEAR.bit.GPIO9 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO10 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO11 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO22 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO23 = 1;	// Drive these pins low, enable serial data transfer
    SpiaRegs.SPITXBUF = ((unsigned)0x20)<<8;  // CLR COUNT all five chips
    // Transfer 0010 0000 --> 00 100 000 to LS7366: CLR register CNTR
    while (SpiaRegs.SPIFFRX.bit.RXFFST != 1) {} // Wait until RX FIFO has one word
    GpioDataRegs.GPASET.bit.GPIO9 = 1;
    GpioDataRegs.GPASET.bit.GPIO10 = 1;
    GpioDataRegs.GPASET.bit.GPIO11 = 1;
    GpioDataRegs.GPASET.bit.GPIO22 = 1;
    GpioDataRegs.GPASET.bit.GPIO23 = 1;	// Pull pins high to disable serial data transfer
    SPIbyte1 = SpiaRegs.SPIRXBUF;  // Read from SPI RX BUFF (I guess it would be reading nonsense)
    // Setting counter of LS7366


    SpiaRegs.SPICTL.bit.SPIINTENA = 1; // Enable the SPI to generate a transmit/receive interrupt
    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR = 1; // Clear RXFFOVF flag (indicates if RX FIFO overflows)
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR = 1; // Clear RXFFINT flag (indicates if FXFIFO int. has occurred)
    SpiaRegs.SPIFFRX.bit.RXFFIENA = 1; // RX FIFO int. based on RXFFIL match Enabled

    /*********  SPI  *************************************/
    /*****************************************************/

    // SPI
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE
    PieCtrlRegs.PIEIER6.bit.INTx1 = 1;  //Enable PIE 6.1 interrupt Page 126 of Sys_Ctrl_and_Int

}

__interrupt void SPI_RXint(void) {
    // SPI receive ISR
    // When the receive interrupt occurs the SPI has also completed transmitting

    GpioDataRegs.GPASET.bit.GPIO9 = 1;
    GpioDataRegs.GPASET.bit.GPIO10 = 1;
    GpioDataRegs.GPASET.bit.GPIO11 = 1;
    GpioDataRegs.GPASET.bit.GPIO22 = 1;
    GpioDataRegs.GPASET.bit.GPIO23 = 1;	// Pull pins high to disable serial data transfer
    GpioDataRegs.GPCSET.bit.GPIO85 = 1;

    //	GpioDataRegs.GPASET.bit.GPIO19 = 1;

    switch (SPIenc_state) {
    case 1:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        // Reading in garbage from sending out one command
        SpiaRegs.SPIFFRX.bit.RXFFIL = 5;
        SPIenc_state = 2;
        // Enter case 2 after this is over (another SPI RX ISR will be triggered since RX data is involved here)
        GpioDataRegs.GPACLEAR.bit.GPIO9 = 1;
        // Pull GPIO0 low start data transfer from U7
        SpiaRegs.SPITXBUF = ((unsigned)0x68)<<8;
        //  0110 1000 --> 01 101 000: Read OTR, get reading of U7 (4 bytes)
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        // Write to U7 to meet SPI specification

        break;
    case 2:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte2 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte3 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte4 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte5 = SpiaRegs.SPIRXBUF & 0xFF;
        // Read from RX FIFO, MSB first; First is garbage generated by sending command
        SPIenc1_reading = (SPIbyte2<<24) | (SPIbyte3<<16) | (SPIbyte4<<8) | SPIbyte5;

        SpiaRegs.SPIFFRX.bit.RXFFIL = 5;
        SPIenc_state = 3;
        GpioDataRegs.GPACLEAR.bit.GPIO10 = 1;
        SpiaRegs.SPITXBUF = ((unsigned)0x68)<<8;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;

        break;
    case 3:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte2 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte3 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte4 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte5 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIenc2_reading = (SPIbyte2<<24) | (SPIbyte3<<16) | (SPIbyte4<<8) | SPIbyte5;

        SpiaRegs.SPIFFRX.bit.RXFFIL = 5;
        SPIenc_state = 4;
        GpioDataRegs.GPACLEAR.bit.GPIO11 = 1;
        SpiaRegs.SPITXBUF = ((unsigned)0x68)<<8;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;

        break;
    case 4:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte2 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte3 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte4 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte5 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIenc3_reading = (SPIbyte2<<24) | (SPIbyte3<<16) | (SPIbyte4<<8) | SPIbyte5;

        SpiaRegs.SPIFFRX.bit.RXFFIL = 5;
        SPIenc_state = 8;
        GpioDataRegs.GPACLEAR.bit.GPIO22 = 1;
        SpiaRegs.SPITXBUF = ((unsigned)0x68)<<8;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;

        break;
    case 5:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte2 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte3 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte4 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte5 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIenc5_reading = (SPIbyte2<<24) | (SPIbyte3<<16) | (SPIbyte4<<8) | SPIbyte5;
        SPIenc_state = 1000;   // large state number so that if error interrupt happends default case will be called
        PieCtrlRegs.PIEIFR12.bit.INTx6 = 1;  // Manually cause the interrupt for the SWI
        // Call control function we used a lot, indicating that data transmission is over
        // Note that case 6 won't be triggered since the value of SPIenc_state is not changed in this case

        break;
    case 6:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIenc_state = 7;

        // Output to DAC Ch2
        SpiaRegs.SPIFFRX.bit.RXFFIL = 3;
        SPIenc_state = 7;
        //			GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
        SpiaRegs.SPIFFRX.bit.RXFFIL = 3;
        SpiaRegs.SPITXBUF = ((unsigned)0x12)<<8;
        SpiaRegs.SPITXBUF = (int)(dac2data << 4);
        SpiaRegs.SPITXBUF = ((int)(dac2data))<<12;

        break;
    case 7:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;


