joe-hung/ME446_repo/C2000Ware_4_01_00_00/device_support/f2833x/examples/f28335_me446starter/F28335_spi.c
        SpiaRegs.SPICCR.bit.CLKPOLARITY = 0;  // set for LS7366
        SpiaRegs.SPICTL.bit.CLK_PHASE = 1;

        SPIenc_state = 0;

        // Debug to see how long 4 SPI enc read takes
        //			GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;

        break;

    case 8:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte2 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte3 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte4 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIbyte5 = SpiaRegs.SPIRXBUF & 0xFF;
        SPIenc4_reading = (SPIbyte2<<24) | (SPIbyte3<<16) | (SPIbyte4<<8) | SPIbyte5;

        SpiaRegs.SPIFFRX.bit.RXFFIL = 5;
        SPIenc_state = 5;
        GpioDataRegs.GPACLEAR.bit.GPIO23 = 1;
        SpiaRegs.SPITXBUF = ((unsigned)0x68)<<8;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;

        break;
    case 9:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;

        if(((SPIbyte1 & 0xFF) == 0xE3)){ //Check to see if Piccolo is reporting SPI error. If 0xE3 is sent from the Picollo it is reporting an SPI error.

            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
            SPIenc_state = 10;
            DELAY_US(20);
            GpioDataRegs.GPCCLEAR.bit.GPIO85 = 1;
            SpiaRegs.SPITXBUF = 0xDC00; //pwmnum				//the pwmnum,msb,lsb values are sent to the Picollo who will be checking for them.
            SpiaRegs.SPITXBUF = 0x0B00; //msb					//The piccolo will eventually resync with the Delfino and stop sending the SPI error message.
            SpiaRegs.SPITXBUF = 0xEF00; //lsb
            SpiaRegs.SPITXBUF = 0x0000; //dec value dummy

        }
        else{

            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;					//The lines below are used for normal SPI operation.
            SPIenc_state = 10;
            DELAY_US(20);			//Added a delay to make sure the chip select line has enough time to change state. Without this line the messages don't send properly.
            GpioDataRegs.GPCCLEAR.bit.GPIO85 = 1;
            SpiaRegs.SPITXBUF = 0x0200; //pwmnum
            SpiaRegs.SPITXBUF = (short)(pwm2); //msb
            SpiaRegs.SPITXBUF = ((short)(pwm2)<<8); //lsb
            SpiaRegs.SPITXBUF = ((short)(dec2)<<8); //lsb of dec2

        }

        break;
    case 10:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;

        if(((SPIbyte1 & 0xFF) == 0xE3)){

            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
            SPIenc_state = 11;
            DELAY_US(20);
            GpioDataRegs.GPCCLEAR.bit.GPIO85 = 1;
            SpiaRegs.SPITXBUF = 0xDC00; //pwmnum
            SpiaRegs.SPITXBUF = 0x0B00; //msb
            SpiaRegs.SPITXBUF = 0xEF00; //lsb
            SpiaRegs.SPITXBUF = 0x0000; //dec

        }
        else{

            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
            SPIenc_state = 11;
            DELAY_US(20);
            GpioDataRegs.GPCCLEAR.bit.GPIO85 = 1;
            SpiaRegs.SPITXBUF = 0x0300; //pwmnum
            SpiaRegs.SPITXBUF = (short)(pwm3); //msb
            SpiaRegs.SPITXBUF = ((short)(pwm3)<<8); //lsb
            SpiaRegs.SPITXBUF = ((short)(dec3)<<8); //lsb of dec3

        }


        break;
    case 11:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;

        if(((SPIbyte1 & 0xFF) == 0xE3)){

            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
            SPIenc_state = 12;
            DELAY_US(20);
            GpioDataRegs.GPCCLEAR.bit.GPIO85 = 1;
            SpiaRegs.SPITXBUF = 0xDC00; //pwmnum
            SpiaRegs.SPITXBUF = 0x0B00; //msb
            SpiaRegs.SPITXBUF = 0xEF00; //lsb
            SpiaRegs.SPITXBUF = 0x0000; //lsb

        }
        else{

            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
            SPIenc_state = 12;
            DELAY_US(20);
            GpioDataRegs.GPCCLEAR.bit.GPIO85 = 1;
            SpiaRegs.SPITXBUF = 0x0400; //pwmnum
            SpiaRegs.SPITXBUF = (short)(pwm4); //msb
            SpiaRegs.SPITXBUF = ((short)(pwm4)<<8); //lsb
            SpiaRegs.SPITXBUF = ((short)(dec4)<<8); //lsb of dec4


        }

        break;
    case 12:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;

        if(((SPIbyte1 & 0xFF) == 0xE3)){

            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
            SPIenc_state = 13;
            DELAY_US(20);
            GpioDataRegs.GPCCLEAR.bit.GPIO85 = 1;
            SpiaRegs.SPITXBUF = 0xDC00; //pwmnum
            SpiaRegs.SPITXBUF = 0x0B00; //msb
            SpiaRegs.SPITXBUF = 0xEF00; //lsb
            SpiaRegs.SPITXBUF = 0x0000; //lsb

        }
        else{

            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
            SPIenc_state = 13;
            DELAY_US(20);
            GpioDataRegs.GPCCLEAR.bit.GPIO85 = 1;
            SpiaRegs.SPITXBUF = 0x0500; //pwmnum
            SpiaRegs.SPITXBUF = (short)(pwm5); //msb
            SpiaRegs.SPITXBUF = ((short)(pwm5)<<8); //lsb
            SpiaRegs.SPITXBUF = ((short)(dec5)<<8); //lsb of dec5

        }

        break;
    case 13:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIenc_state = 0;
        pwm_finished = 1;
        SPI_finished = 1;


        break;
    default:
        SPIbyte1 = SpiaRegs.SPIRXBUF;
        SPIbyte2 = SpiaRegs.SPIRXBUF;  // these reads are not needed except to add some delay
        SPIbyte3 = SpiaRegs.SPIRXBUF;
        SPIbyte4 = SpiaRegs.SPIRXBUF;
        SPIbyte5 = SpiaRegs.SPIRXBUF;
        SPIenc_state_errors++;
        break;
    }

    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR=1;  // Clear Overflow flag
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR=1; 	// Clear Interrupt flag
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE




