joe-hung/ME446_repo/C2000Ware_4_01_00_00/device_support/f2833x/examples/f28335_me446starter/F28335_spi.c
}

long errortoosoon = 0;
long SPI_finished_error = 0;
void start_SPI(void) {
    // Called every 1 millisecond inside the ADC’s ISR

    if (SPI_finished == 1) {
        SPI_finished = 0;
        if (SPIenc_state != 0) {
            errortoosoon++;
        } else {
            SpiaRegs.SPIFFRX.bit.RXFFIL = 1;
            GpioDataRegs.GPACLEAR.bit.GPIO9 = 1;
            GpioDataRegs.GPACLEAR.bit.GPIO10 = 1;
            GpioDataRegs.GPACLEAR.bit.GPIO11 = 1;
            GpioDataRegs.GPACLEAR.bit.GPIO22 = 1;
            GpioDataRegs.GPACLEAR.bit.GPIO23 = 1;	// Drive pins low to start serial data transfer
            SPIenc_state = 1;
            SpiaRegs.SPITXBUF = ((unsigned)0xE8)<<8; // Latch All ENCs
            // Transfer 1110 1000 --> 11 101 000: transfer CNTR to OTR in "parallel"
            // OTR is for storing value of CNTR, then it can be read without interfering with the cnting process
            // After this function, SPI_RXint will be called
        }
    } else {
        SPI_finished_error++;
    }
}

void writeDAC7564(float dac1,float dac2) {

    int rawdac1,rawdac2;

    SpiaRegs.SPICCR.bit.CLKPOLARITY = 0;  // set for DAC7564
    SpiaRegs.SPICTL.bit.CLK_PHASE = 0;

    rawdac1 = (int) (dac1 * 1638 + 0.5); // The 0.5 is used to round to the nearest integer
    rawdac2 = (int) (dac2 * 1638 + 0.5); // The 0.5 is used to round to the nearest integer


    if (rawdac1 < 0) rawdac1 = 0;
    if (rawdac1 > 4095) rawdac1 = 4095;
    if (rawdac2 < 0) rawdac2 = 0;
    if (rawdac2 > 4095) rawdac2 = 4095;

    dac1data = rawdac1;
    dac2data = rawdac2;

    // Output to DAC Ch1
    SpiaRegs.SPIFFRX.bit.RXFFIL = 3;
    SPIenc_state = 6;
    //	GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPIFFRX.bit.RXFFIL = 3;
    SpiaRegs.SPITXBUF = ((unsigned)0x10)<<8;
    SpiaRegs.SPITXBUF = (int)(dac1data << 4);
    SpiaRegs.SPITXBUF = ((int)(dac1data))<<12;

}

long pwm_finished_errors = 0;
// 6/3/2016
void sendPWM(float u1, float u2, float u3, float u4, float u5) {
    if (pwm_finished == 1) {
        pwm_finished = 0;
        if (u1 > 10.0F) {
            u1 = 10.0F;
        } else if (u1 < -10.0F) {
            u1 = -10.0F;
        }
        if (u2 > 10.0F) {
            u2 = 10.0F;
        } else if (u2 < -10.0F) {
            u2 = -10.0F;
        }
        if (u3 > 10.0F) {
            u3 = 10.0F;
        } else if (u3 < -10.0F) {
            u3 = -10.0F;
        }
        if (u4 > 10.0F) {
            u4 = 10.0F;
        } else if (u4 < -10.0F) {
            u4 = -10.0F;
        }
        if (u5 > 10.0F) {
            u5 = 10.0F;
        } else if (u5 < -10.0F) {
            u5 = -10.0F;
        }

        // 3000 is 28027's frequency
        pwm1 = 3000.0*(u1/10.0F);
        pwm2 = 3000.0*(u2/10.0F);
        pwm3 = 3000.0*(u3/10.0F);
        pwm4 = 3000.0*(u4/10.0F);
        pwm5 = 3000.0*(u5/10.0F);

        dec1 = fabs(pwm1) - fabs((short)pwm1);
        dec2 = fabs(pwm2) - fabs((short)pwm2);
        dec3 = fabs(pwm3) - fabs((short)pwm3);
        dec4 = fabs(pwm4) - fabs((short)pwm4);
        dec5 = fabs(pwm5) - fabs((short)pwm5);

        //pwm4 and pwm5 do not have high resolution capabilities. The dec4,dec5 lines above and below are
        //just calculating the decimal value to be consistent with the rest of the pwm signals
        //When sent over SPI they will be assigned to the correct PWM signal, but not put into any pwm
        //register because the high resolution doesn't exist for pwm4 and pwm5

        dec1 = (dec1*111)+.5;
        dec2 = (dec2*111)+.5;
        dec3 = (dec3*111)+.5;
        dec4 = (dec4*111)+.5;
        dec5 = (dec5*111)+.5;

        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        SPIenc_state = 9;
        GpioDataRegs.GPCCLEAR.bit.GPIO85 = 1;
        SpiaRegs.SPITXBUF = 0x0100; //pwmnum
        SpiaRegs.SPITXBUF = (short)pwm1; //MSB
        SpiaRegs.SPITXBUF = ((short)pwm1)<<8; //LSB
        SpiaRegs.SPITXBUF = ((short)dec1)<<8; //LSB of Dec1 which is the actual value




    } else {
        pwm_finished_errors++;
    }

}
